tutorials/straightDuct/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs
(
    "libcompressibleRASModels.so"
    "liblduSolvers.so"
)

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           10;

maxDeltaT       1;

functions
(
    massflow1
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      inlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;

        fields
        (
           phi
           h
        );
    }
    
    massflow2
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      outlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       sum;

        fields
        (
           phi
           h
        );
    }

    heatFlux1
    {
        type heatFlux;
	functionObjectLibs ("libsimpleFunctionObjects.so");
        region          fluid;
        enabled         true;
        outputControl   outputTime;
	log			   true;
        K              k;
        
    }

    faceAverageInlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      inlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            p
            T
            U
            h
            rho
        );
    }

    faceAverageOutlet
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;
        enabled         true;
        outputControl   outputTime;

        // Output to log&file (true) or to file only
        log             true;

        // Output field values as well
        valueOutput     true;

        // Output value format
        surfaceFormat   foamFile;

        // Type of source: patch/faceZone/sampledSurface
        source          patch;

        // if patch or faceZone: name of patch or faceZone
        sourceName      outlet;

        // Operation: areaAverage/sum/weightedAverage ...
        operation       areaAverage;

        fields
        (
            p
            T
            U
            h
            rho
        );
    }

    volAverageFluid
    {
        type            cellSource;
        functionObjectLibs ("libfieldFunctionObjects.so");

        region          fluid;

        enabled         true;

        outputControl   outputTime;
        log             true;
        valueOutput     true;

        source          all;
        operation       volAverage;

        fields
        (
            p
            U
            T
            rho
        );
    }
);


// ************************************************************************* //
