tutorials/straightDuct/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors     3;
    nNonOrthogonalCorrectors 2;
    momentumPredictor yes;
    pMin            pMin [ 1 -1 -2 0 0 0 0 ] 1000;
}

relaxationFactors
{
    U               0.7;
    UFinal          1.0;
    p               0.3;
    rho             0.05;
    h               0.7;
    hFinal          1.0;
    k               0.7;
    omega           0.7;
}


// ************************************************************************* //
