tutorials/straightDuct/Allrun
#!/bin/sh

# m4 constant/fluid/polyMesh/blockMeshDict.m4 > constant/fluid/polyMesh/blockMeshDict   Original

blockMesh -region fluid

multiRegionFoam 
